import { resInit } from "@/app/globals";
import { NextResponse } from "next/server";

type poem = {
	verses: string[][];
	source: string;
};
const poems: poem[] = [
	{
		source: "فمن للأمة الغرقى",
		verses: [
			[
				"فمن للأمة الغرقى إذا كنا الغريقين",
				"و من للغاية الكبرى إذا ضمرت أمانينا",
			],
			["و من للحق يجلوه إذا كلت أيادينا"],
		],
	},
	{
		source: "فمن للأمة الغرقى",
		verses: [
			[
				"فما المعنى بأن نحيا فلا نحيي بنا الدين",
				"و ما المعنى بأن نجتر مجدا ماضيا فينا",
			],
		],
	},

	{
		source: "الفجر الباسم قادم",
		verses: [
			["الفجر الباسم قادم"],
			["بشباب صلوا الفجرَ", "برجال باعوا العمرَ"],
			["بشيوخٍ كانوا شعلا", "بالليل تشع الفكرة"],
		],
	},
	{
		source: "الفجر الباسم قادم",
		verses: [
			["الفجر الباسم قادم"],
			["بصغار عرفوا اللهَ", "بالفطرة لا بسواها"],
			["و هم البشرى للدنيا", "و غدًا يمحون أساها"],
		],
	},
	{
		source: "الفجر الباسم قادم",
		verses: [
			["الفجر الباسم قادم"],
			["بكتاب ظل دليلًا", "للأمة جيلًا جيلًا"],
			["من حيرتها يهديها", "و يعيد المجد أصيلا"],
		],
	},
	{
		source: "الفجر الباسم قادم",
		verses: [
			["الفجر الباسم قادم"],
			["بالأمل العذب السامي", "بالهمة بالإقدام"],
			["و بأنا خير هداة", "في ذاكرة الأيام"],
		],
	},

	{
		source: "الفجر الباسم قادم",
		verses: [
			["الخير الباقي فينا", "يكفينا بل يحيينا"],
			["ما دام الروح طموحًا", "و القلب يفيض يقينًا"],
		],
	},
];

export async function GET() {
	const choosen = poems[Math.floor(Math.random() * poems.length)];
	return NextResponse.json(choosen, resInit);
}

export async function OPTIONS() {
	return NextResponse.json("", resInit);
}
